sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
/**
 ****************************************************************************************
 *
 * @file ble_arp.c
 *
 * @brief DA14531/535 RF driver
 *
 * Copyright (C) 2018-2025 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 ****************************************************************************************
 */

#if defined (__DA14531__)
#if !defined (__FPGA__)

/*
 * INCLUDE FILES
 ****************************************************************************************
 */

#include "rwip_config.h"        // RW SW configuration

#include <string.h>             // for memcpy
#include "compiler.h"
#include "co_utils.h"           // common utility definition
#include "co_math.h"            // common math functions
#include "co_endian.h"          // endian definitions
#include "rf.h"                 // RF interface
#include "plf.h"                // Platform functions

#include "rwip.h"               // for RF API structure definition
#include "arch.h"

#if (BLE_EMB_PRESENT)
#include "reg_blecore.h"        // ble core registers
#include "reg_ble_em_cs.h"      // control structure definitions
#endif //BLE_EMB_PRESENT

#if (BT_EMB_PRESENT)
#include "lc_epc.h"             // Enhanced Power Control definitions
#include "reg_btcore.h"         // bt core registers
#include "reg_bt_em_cs.h"       // control structure definitions
#endif //BT_EMB_PRESENT

#include "_reg_common_em_et.h"
#include "em_map.h"
#include "rf_531.h"
#include "syscntl.h"
#include "otp_cs.h"
#include "arch_system.h"
#include "lld.h"
#include "system_library.h"

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
#include "lld_evt.h"
#endif

#include "da1458x_scatter_config.h"     // ble_base value

/*
 * DEFINES
 ****************************************************************************************
 */
#define ARP_TX_DELAY   (10)
#define ARP_RX_DELAY   (10)

/*
 * ARP - Automatic Radio Programming
 */
#define ARPT_PWR_ENTRIES    (1)

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
#define ARPT_PREF_ENTRIES   (16)
#else
#define ARPT_PREF_ENTRIES   (14)
#endif

#define ARPT_TX_ENTRIES     (3)
#define ARPT_RX_ENTRIES     (3)

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
#define ARPT_RF_PA_CTRL_REG_IDX     (13)
#define ARPT_RF_ATTR_REG_IDX        (14)
#endif

/*
 * TYPE DEFINITIONS
 ****************************************************************************************
 */

/*
 * ARP table entry definition
 */
typedef union {
    uint32_t value;
    struct {
        unsigned data      : 16;
        unsigned addr      : 14;
        unsigned data8or16n: 1;    // 1:8bit data, 0:16bit data
        unsigned valid     : 1;    // 1: valid, 0:invalid
    } bf;
} __attribute((aligned(4))) t_arp_reg;

/*
 * ARP Table structure
 */
struct s_arp_table {
    // ARPT_PWR
    t_arp_reg  arpt_pwr[ARPT_PWR_ENTRIES];
    uint32_t   null1;

    // ARPT_PREF
    uint16_t   tx_tbase;
    uint16_t   rx_tbase;
    t_arp_reg  arpt_pref[ARPT_PREF_ENTRIES];
    uint32_t   null2;

    // ARPT_TX
    t_arp_reg  tx_en_delay;
    t_arp_reg  arpt_tx[ARPT_TX_ENTRIES];
    uint32_t   null3;

    // ARPT_RX
    t_arp_reg  rx_en_delay;
    t_arp_reg  arpt_rx[ARPT_RX_ENTRIES];
    uint32_t   null4;
} __attribute((aligned(4)));

#if defined (__DA14531_01__) || defined (__DA14535__)
struct s_arp_table_ROM {
    // ARPT_PWR
    t_arp_reg  arpt_pwr[ARPT_PWR_ENTRIES];
    uint32_t   null1;

    // ARPT_PREF
    uint16_t   tx_tbase;
    uint16_t   rx_tbase;
    t_arp_reg  arpt_pref[16];
    uint32_t   null2;

    // ARPT_TX
    t_arp_reg  tx_en_delay;
    t_arp_reg  arpt_tx[ARPT_TX_ENTRIES];
    uint32_t   null3;

    // ARPT_RX
    t_arp_reg  rx_en_delay;
    t_arp_reg  arpt_rx[ARPT_RX_ENTRIES];
    uint32_t   null4;
} __attribute((aligned(4)));
#endif // DA14531-01 or DA14535

static void ble_update_arp(void);
static void ble_update_arp_adpll_div_val(void);
//static void update_radiopwrupdn_pref_setting(void);
static uint8_t rf_txpwr_dbm_get(uint8_t conidx, uint8_t req_pwr_level);

uint32_t rf_reg_rd (uint16_t address);
void rf_reg_wr (uint16_t address, uint32_t data);

#if defined (__DA14531_01__) && !defined (__EXCLUDE_ROM_BLE_ARP__)
extern uint8_t rf_rssi_convert (uint8_t rssi_reg);
#endif // __EXCLUDE_ROM_BLE_ARP__

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_BLE_ARP__)
// Required DA14531-01, DA14535 ROM symbols
extern struct s_arp_table_ROM arp_init_table;
extern void rf_sleep(void);
extern void update_radiopwrupdn_pref_setting(void);
extern void rf_regs(void);
extern void ble_update_arp_adpll_calib_vals_ROM(volatile struct s_arp_table *arp_table);
extern void ble_update_arp_adpll_div_val_ROM(volatile struct s_arp_table *arp_table);
extern void ble_update_arp_ROM(volatile struct s_arp_table *arp_table);
#endif // __EXCLUDE_ROM_BLE_ARP__

#if (USE_RF_LDO_CALIBRATION)
bool rf_ldo_calibration_pending     __SECTION_ZERO("retention_mem_area0");
uint8_t rf_ldo_init_value           __SECTION_ZERO("retention_mem_area0");
#endif

/*****************************************************************************************
 * @brief Ripple specific read access
 *
 * @param[in] addr    register address
 *
 * @return uint32_t value
 ***************************************************************************************
 */

uint32_t rf_reg_rd (uint16_t address)
{
    return 0;
}

/*****************************************************************************************
 * @brief Ripple specific write access
 *
 * @param[in] addr    register address
 * @param[in] value   value to write
 *
 * @return uint32_t value
 ****************************************************************************************
 */
void rf_reg_wr (uint16_t address, uint32_t data)
{

