sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
}


/**
 *****************************************************************************************
 * @brief Init RF sequence after reset.
 *****************************************************************************************
 */
static void rf_reset(void)
{

}

#ifdef CFG_BT
static void rf_txpwr_max(uint8_t link_id)
{
}

/**
 *****************************************************************************************
 * @brief Increase the TX power by one step
 *
 * @param[in] link_id Link ID for which the TX power has to be increased
 *
 * @return true when maximum power is reached, false otherwise
 *****************************************************************************************
 */
static bool rf_txpwr_inc(uint8_t link_id)
{
}
/**
 *****************************************************************************************
 * @brief Increase the TX power by one step
 *
 * @param[in] link_id Link ID for which the TX power has to be increased
 *
 * @return true when maximum power is reached, false otherwise
 *****************************************************************************************
 */
static bool rf_txpwr_epc_inc(uint8_t link_id)
{
}
/**
 *****************************************************************************************
 * @brief Decrease the TX power by one step
 *
 * @param[in] link_id Link ID for which the TX power has to be decreased
 *
 * @return true when minimum power is reached, false otherwise
 *****************************************************************************************
 */
static bool rf_txpwr_dec(uint8_t link_id)
{
}

/**
 *****************************************************************************************
 * @brief Decrease the TX power by one step
 *
 * @param[in] link_id Link ID for which the TX power has to be decreased
 *
 * @return true when minimum power is reached, false otherwise
 *****************************************************************************************
 */
static bool rf_txpwr_epc_dec(uint8_t link_id)
{
}


/**
 ****************************************************************************************
 * @brief Execute the EPC request received from the peer device.
 *
 * @param[in] link_id     Link Identifier
 * @param[in] action      Increase, decrease or go to maximum
 *
 * @return Tx power status depending the modulation
 *
 ****************************************************************************************
 */
static uint8_t rf_txpwr_epc_req(uint8_t link_id, uint8_t action)
{
}


/**
 *****************************************************************************************
 * @brief Get the TX power as control structure TX power field from a value in dBm.
 *
 * @param[in] txpwr_dbm   TX power in dBm
 *
 * @return The index of the TX power
 *
 *****************************************************************************************
 */
static uint8_t rf_txpwr_cs_get (int8_t txpwr_dbm)
{
}
#endif

#if !defined (__DA14531_01__) || defined (__EXCLUDE_ROM_BLE_ARP__)
/**
 *****************************************************************************************
 * @brief Convert RSSI to dBm
 *
 * @param[in] rssi_reg RSSI read from the HW registers
 *
 * @return The converted RSSI
 *
 *****************************************************************************************
 */
static uint8_t rf_rssi_convert (uint8_t rssi_reg)
{
    uint8_t RSSI_Value_temp = rssi_reg;

    /* RSSI calculation formula:
     * DA14531: The equation to use for Input Power = 0.498 * RSSI - 127,
     * DA14535: The equation to use for Input Power = 0.491 * RSSI - 126,
     * where the RSSI is 8-bit value used by SDK.
     * The range of valid RSSI values is 40 to 230.
     * Any values lower then 40 should be ceiled to 40.
     * Any values higher than 230 should be floored to 230.
    */
    if (rssi_reg < 40)
    {
        RSSI_Value_temp = 40;
    }
    else if (rssi_reg > 230)
    {
        RSSI_Value_temp = 230;
    }

#if defined (__DA14535__)
    return (uint8_t) ((uint8_t) (-126) + (uint8_t) ((491 * RSSI_Value_temp) / 1000));
#else
    return (uint8_t) ((uint8_t) (-127) + (uint8_t) ((498 * RSSI_Value_temp) / 1000));
#endif
}
#endif // __EXCLUDE_ROM_BLE_ARP__

#ifdef CFG_BLE
/**
 ****************************************************************************************
 * @brief ISR to be called in BLE ISR routine when RF Interrupt occurs.
 *****************************************************************************************
 */
static void RADIOCNTL_Handler(void)
{
}

/**
 *****************************************************************************************
 * @brief Enable/disable force AGC mechanism
 *
 * @param[in]  True: Enable / False: disable
 *****************************************************************************************
 */
static void rf_force_agc_enable(bool en)
{
}
#endif //CFG_BLE

/**
 *****************************************************************************************
 * @brief Gets the register value which controls the TX output power
 *
 * @param[in] conidx        Connection index (0xFF for advertising)
 * @param[in] req_pwr_level Requested power level (max or current)
 *
 * @return The register value which controls the TX output power
 *
 *****************************************************************************************
 */
static uint8_t rf_txpwr_dbm_get(uint8_t conidx, uint8_t req_pwr_level)
{
    rf_tx_pwr_lvl_t tx_pow_lvl = RF_TX_PWR_LVL_0d0;
    ASSERT_ERROR((req_pwr_level == TX_PWR_LVL_MAX) || (req_pwr_level == TX_PWR_LVL_CURRENT));
    ASSERT_ERROR((conidx < CFG_MAX_CONNECTIONS) || (conidx == 0xFF));

    if (conidx == 0xFF)
    {
        // Advertising mode
#if defined (CFG_ENHANCED_TX_PWR_CTRL)
        tx_pow_lvl = rf_pa_pwr_adv_get();
#else
        tx_pow_lvl = rf_pa_pwr_get();
#endif
    }
    else
    {
         // Connected mode
        if (req_pwr_level == TX_PWR_LVL_MAX)
        {
            tx_pow_lvl = RF_TX_PWR_LVL_MAX_DBM;
        }
        else
        {
#if defined (CFG_ENHANCED_TX_PWR_CTRL)
            tx_pow_lvl = rf_pa_pwr_conn_get(conidx);
#else
            tx_pow_lvl = rf_pa_pwr_get();
#endif
        }
    }

    return (uint8_t) tx_pow_lvl;
}

#if (!defined (__DA14531_01__) && !defined (__DA14535__)) || defined (__EXCLUDE_ROM_BLE_ARP__)
/**
 *****************************************************************************************
 * @brief Sleep function for the RF.
 *****************************************************************************************
 */
static void rf_sleep(void)
{
    ble_deepslcntl_set(ble_deepslcntl_get() |
                      BLE_DEEP_SLEEP_ON_BIT |    // RW BLE Core sleep
                      BLE_RADIO_SLEEP_EN_BIT |   // Radio sleep
                      BLE_OSC_SLEEP_EN_BIT);     // Oscillator sleep

    SetBits32(BLE_CNTL2_REG, BB_ONLY,0);
}

/**
 *****************************************************************************************
 * @brief Get RF preferred setting for radiopwrupdn.
 *
 * For BLE this value will be increased with ARP_RX_DELAY and ARP_TX_DELAY
 * NOTE: BE AWARE THIS FUNCTION MAY BE CALLED ONLY ONCE, PREFERABLE DIRECT AFTER SET_RECOMMENDED_SETTINGS
 *****************************************************************************************
 */
static void update_radiopwrupdn_pref_setting(void)
{
    uint32_t reg = GetWord32(BLE_RADIOPWRUPDN_REG);
    uint32_t ble_rxpwrup = GetBits32(&reg, RXPWRUP) + ARP_RX_DELAY;
    uint32_t ble_txpwrup = GetBits32(&reg, TXPWRUP) + ARP_TX_DELAY;

