sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
    reg &= ~(RXPWRUP | TXPWRUP);
    reg |= (ble_rxpwrup << SHIF32(RXPWRUP)) | (ble_txpwrup << SHIF32(TXPWRUP));
    SetWord32(BLE_RADIOPWRUPDN_REG, reg);
}

/**
 *****************************************************************************************
 * @brief Initialization of RF registers.
 *****************************************************************************************
 */
static void rf_regs(void)
{
    syscntl_cfg_xtal32m_amp_reg(XTAL32M_AMP_REG_HOLD);      // switch to HOLD mode

    /***
     *** Init BLE
     ***/
    // Note: ble_report_check_rx() will toggle BLE_RSSI_SEL on each Rx !
    SetBits32(BLE_CNTL2_REG, BLE_RSSI_SEL, 0);    // 0: Select Peak-hold RSSI value (default), 1: Select current Average RSSI.

    SetWord32(BLE_RADIOCNTL1_REG, 0);

    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);       // Select on-chip radio type: 2 is the only choice

    SetBits32(BLE_RWBLECNTL_REG, RXWINSZDEF, 14);   // Using 14us, just like final Application does.
                                                    // 10=recommended. 0 is not a valid value.
                                                    // Only in slave or initiator or scanner device and only during the 1st Rx
                                                    // the ctrl_struct->rxwinsz will be used.
}
#endif // __EXCLUDE_ROM_BLE_ARP__

/*
 * RADIO FUNCTION INTERFACE
 ****************************************************************************************
 */
#define EM_BLE_FREQ_TABLE_LEN       EM_RF_FREQ_TABLE_LEN

void rf_init_func(struct rwip_rf_api *api)
{
    uint8_t idx = 0;
    uint8_t temp_freq_tbl[EM_BLE_FREQ_TABLE_LEN];

    // Initialize the RF driver API structure
    api->reg_rd = rf_reg_rd;
    api->reg_wr = rf_reg_wr;
    api->txpwr_dbm_get = rf_txpwr_dbm_get;

    api->txpwr_max = 0;//RPL_POWER_MAX;
    api->sleep = rf_sleep;
    api->reset = rf_reset;
#if defined (CFG_BLE)
    api->isr = RADIOCNTL_Handler;
    api->force_agc_enable = rf_force_agc_enable;
#endif //CFG_BLE

    api->rssi_convert = rf_rssi_convert;

#if defined (CFG_BT)
    api->txpwr_inc = rf_txpwr_inc;
    api->txpwr_dec = rf_txpwr_dec;
    api->txpwr_epc_req = rf_txpwr_epc_req;
    api->txpwr_cs_get = rf_txpwr_cs_get;
    api->rssi_convert = rf_rssi_convert;
    api->rssi_high_thr = (uint8_t)RPL_RSSI_20dB_THRHLD;
    api->rssi_low_thr = (uint8_t)RPL_RSSI_60dB_THRHLD;
    api->rssi_interf_thr = (uint8_t)RPL_RSSI_70dB_THRHLD;
    #ifdef CFG_BTCORE_30
    api->wakeup_delay = RPL_WK_UP_DELAY;
    #endif //CFG_BTCORE_30
    api->skew = RPL_RADIO_SKEW;
#endif //CFG_BT

#if !defined (__FPGA__)
    rf_power_up();
#endif

    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);

    SetBits32(BLE_CNTL2_REG, SW_RPL_SPI, 0);
    while (idx < EM_BLE_FREQ_TABLE_LEN) {
            temp_freq_tbl[idx] = idx ;
            idx++;
    }
    em_ble_burst_wr(&temp_freq_tbl[0], EM_FT_OFFSET, EM_BLE_FREQ_TABLE_LEN);

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    // Initialize Tx output power level to default 0dBm
    rf_pa_pwr_set(RF_TX_PWR_LVL_0d0);

    //  Near Field Mode Enable
    if (rf_nfm_is_enabled())
    {
        rf_pa_pwr_set(RF_TX_PWR_LVL_MIN_DBM);
    }
#else
    // Initialize Tx output power level to default 0dBm
    rf_pa_pwr_adv_set(RF_TX_PWR_LVL_0d0);
#endif

    // Activate ADPLL block to make its registers accessible
    rf_adplldig_activate();

    otp_cs_load_pd_rad();                // Preferred settings for PD_RAD from OTP CS

    otp_cs_load_pd_adpll();              // Preferred settings for PD_ADPLL from OTP CS

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
    // NOTE: Needed in ble_update_arp() call below!!
    SetWord32(ADPLL_DIV_CTRL_REG, otp_cs_get_adpll_div_ctrl_0dBm());
#endif

    set_recommended_settings();          // Preferred settings

    update_radiopwrupdn_pref_setting();

    rf_regs();

    rf_calibration();                           // Calibration
#if (USE_RF_LDO_CALIBRATION)
    rf_ldo_calibration_pending = true;
    rf_ldo_init_value = GetBits16(RF_LDO_CTRL_REG, LDO_RADIO_LEVEL);
    rf_ldo_calibration();
#endif
    ble_update_arp();                           // update with cal results

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();
}

void rf_reinit_func(void)
{
    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);
    SetBits32(BLE_RWBLECNTL_REG, SYNCERR, 0); //this must be always '0'

    SetBits16(CLK_RADIO_REG, RFCU_ENABLE, 1);

    if ( arch_clk_is_XTAL32( ) )
    {
        //If LP clock is XTAL32 in Boost mode set XTAL32K_CUR to 1.
        if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
            SetBits16(CLK_XTAL32K_REG,  XTAL32K_CUR, 1);
    }

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    //  Near Field Mode Enable
    if (rf_nfm_is_enabled())
    {
        rf_pa_pwr_set(RF_TX_PWR_LVL_MIN_DBM);
    }
#endif

    // Activate ADPLL block to make its registers accessible
    rf_adplldig_activate();

    otp_cs_load_pd_rad();                // Trim values for PD_RAD from OTP CS

    otp_cs_load_pd_adpll();              // Trim values for PD_ADPLL from OTP CS

    set_recommended_settings();          // Preferred settings

    update_radiopwrupdn_pref_setting();

    rf_regs();

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    ble_update_arp_adpll_div_val();
#endif

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();

#if defined (CFG_RF_DIAG_INT)
    enable_rf_diag_irq(RF_DIAG_IRQ_MODE_RXTX);
#endif
}

// arp_table has to be allocated after the freq_idx_table and before ctrl_struct
volatile struct s_arp_table *const arp_table = (struct s_arp_table *) (uint32_t) (__SCT_BLE_BASE + EM_RF_ARP_OFFSET);

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_BLE_ARP__)
static void ble_update_arp_adpll_calib_vals(void)
{
    ble_update_arp_adpll_calib_vals_ROM(arp_table);
}
#else
static void ble_update_arp_adpll_calib_vals(void)
{
    //read out reg, be sure calibration has be done and adpll ldo-on and hclk-en
    arp_table->arpt_pref[4].bf.data = GetWord16(ADPLL_KDTCTDC_CAL_CTRL1_REG);
    arp_table->arpt_pref[5].bf.data = GetWord16(ADPLL_KDTCTDC_CAL_CTRL1_REG+2);
}
#endif // __EXCLUDE_ROM_BLE_ARP__

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_BLE_ARP__)
static void ble_update_arp_adpll_div_val(void)
{
    ble_update_arp_adpll_div_val_ROM(arp_table);
}
#else
static void ble_update_arp_adpll_div_val(void)
{
    arp_table->arpt_pref[7].bf.data = GetWord16(ADPLL_DIV_CTRL_REG);
    arp_table->arpt_pref[8].bf.data = GetWord16(ADPLL_DIV_CTRL_REG+2);
}
#endif // __EXCLUDE_ROM_BLE_ARP__

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_BLE_ARP__)
static void ble_update_arp(void)
{
    ble_update_arp_ROM(arp_table);
}
#else
static void ble_update_arp(void)
{
    ble_update_arp_adpll_calib_vals();
    ble_update_arp_adpll_div_val();
    arp_table->arpt_pref[3].bf.data = GetWord16(ADPLL_KDCO_CAL_CTRL1_REG);
    arp_table->arpt_pref[9].bf.data = GetWord16(ADPLL_ACC_CTRL_REG);
    arp_table->arpt_pref[10].bf.data = GetWord16(ADPLL_ACC_CTRL_REG+2);

