sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
//    arp_table->arpt_pref[xx].bf.data = GetWord16(ADPLL_DCOAMP_CAL_CTRL_REG);  For bit 0..15 an entry in ble_arp block is not necessary, is same as reset value
    arp_table->arpt_pref[11].bf.data = GetWord16(ADPLL_DCOAMP_CAL_CTRL_REG+2);

    arp_table->arpt_pref[12].bf.data = GetWord16(ADPLL_TXMOD_CTRL_REG);
}
#endif // __EXCLUDE_ROM_BLE_ARP__

#if (!defined (__DA14531_01__) && !defined (__DA14535__)) || defined (__EXCLUDE_ROM_BLE_ARP__)
const struct s_arp_table arp_init_table = {
    // ARPT_PWR
    .arpt_pwr[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & RF_RADIO_INIT_REG,
                      .data        = ADPLLDIG_PWR_SW1_EN,                                   // ADPLLDIG_LDO enable and set ADPLLDIG register file reset
                      .data8or16n  = 0,                                                     // Word write
    },

    // The delay between enabling ADPLLDIG_PWR_SW1_EN and the parsing of arpt_pref table is defined by RF_ADPLLDIG_CTRL_REG[PWR_SW_TIM_CTRL]

    // ARPT_PREF
    .arpt_pref[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 1),                    // 2nd byte address
                      .data        = (ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN) >> 8,           // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ANA_CTRL_REG + 1),
                      .data        = (0xFF) & ((ADPLL_ANA_CTRL_REG_RESET | 0xB00) >> 8),    // Pref setting (DTC offset)
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_RFPT_CTRL_REG),
                      .data        = (0xFF) & (ADPLL_RFPT_CTRL_REG_RESET | INV_CKRFPT),     // Pref setting (Invert RFPT clock)
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[3].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDCO_CAL_CTRL1_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[4].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDTCTDC_CAL_CTRL1_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_calib_vals()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[5].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDTCTDC_CAL_CTRL1_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_calib_vals()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[6].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_OVERRULE_CTRL1_REG+1),
                      .data        = (0xFF) & ((OVR_VPAEN_WR | OVR_VPAEN_SEL) >> 8),        // Pref setting (VPA enable overrule)
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[7].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DIV_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_div_val()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[8].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DIV_CTRL_REG + 2),                   // 2nd word address
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_div_val()
                      .data8or16n  = 0,                                                     // Word write
    },


    .arpt_pref[9].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ACC_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[10].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ACC_CTRL_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },


    .arpt_pref[11].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DCOAMP_CAL_CTRL_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[12].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_TXMOD_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
    .arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_PA_CTRL_REG),
                      .data        = 0x300,                                                 // Set PA_RAMP_STEP_SPEED, TRIM_DUTY_NEG, TRIM_DUTY_POS (reset values)
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[ARPT_RF_ATTR_REG_IDX].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_ATTR_REG + 2),                          // 2nd word address
                      .data        = (RF_TX_PWR_LVL_0d0 << 8),                              // Set output power to default 0dBm
                      .data8or16n  = 0,                                                     // Word write
    },
#endif

    .arpt_pref[ARPT_PREF_ENTRIES - 1].bf = {                                                // This must always be the last entry
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 1),                    // 2nd byte address
                      .data        = (ADPLLDIG_HRESET_N >> 8),                              // Disable ADPLLDIG register interface clock
                      .data8or16n  = 1,                                                     // Byte write
    },

    // ARPT_TX
    .tx_en_delay.bf = {
                      .valid       = 1,
                      .data        = ARP_TX_DELAY,
                      .addr        = 0,                                                     // Dummy value
    },

