sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
    .arpt_tx[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG ),
                      .data        = (ADPLLDIG_PWR_SW1_EN | ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN),     // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_tx[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & ADPLL_CN_CTRL_REG,                          // addr section defines the location where arp_cn[] should be written
                      .data        = 0,                                                     // Don't care, arp_cn[] comes from the BLE block
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_tx[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 2),                    // 2nd byte address
                      .data        = (RADIO_REGS_RDY | ADPLLDIG_HCLK_DIS) >> 16,            // Disable ADPLLDIG register interface clock and set the RADIO_REGS_RDY bit field to 1
                      .data8or16n  = 1,                                                     // Byte write
    },

    // ARPT_RX
    .rx_en_delay.bf = {
                      .valid       = 1,
                      .data        = ARP_RX_DELAY,                                          // ARP_RX_DELAY JS
                      .addr        = 0,                                                     // Dummy value
    },

    .arpt_rx[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG),
                      .data        = (ADPLLDIG_PWR_SW1_EN | ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN), // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_rx[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & ADPLL_CN_CTRL_REG,                          // addr section defines the location where arp_cn[] should be written. arp_cn[] comes from the BLE block
                      .data        = 0,                                                     // Don't care, arp_cn[] comes from the BLE block
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_rx[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 2),                    // 2nd byte address
                      .data        = (RADIO_REGS_RDY | ADPLLDIG_HCLK_DIS) >> 16,            // Disable ADPLLDIG register interface clock and set the RADIO_REGS_RDY bit field to 1
                      .data8or16n  = 1,                                                     // Byte write
    },
};
#endif // __EXCLUDE_ROM_BLE_ARP__

/*********************************************************************************
 *** ble_init_arp()
 *** About: Load ARP Table values.
 ***        must be executed after ble_init_em()
 ***        in order to have the table pointer up to date and have the Table preloaded with zeros.
 ***/
void ble_init_arp_func(uint32_t base_addr)
{
    ASSERT_WARNING(sizeof(arp_init_table) <= EM_RF_ARP_SIZE_MAX);

#if defined(__IS_SDK6_COMPILER_GCC__) && !defined(__clang__)
    #pragma GCC diagnostic ignored "-Wstringop-overflow"
    #pragma GCC diagnostic ignored "-Warray-bounds"
#endif

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_BLE_ARP__)
#if defined (CFG_ENHANCED_TX_PWR_CTRL)
    memcpy((uint32_t *)arp_table, &arp_init_table, sizeof(arp_init_table));
#if defined (__DA14535__)
    // Re-initialize table entry since the ROM `arp_init_table` variable was built with the DA14531 dBm enumeration
    arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = RF_TX_PWR_LVL_0d0 << 8;
#endif
#else
    memcpy((uint32_t *)arp_table, &arp_init_table, (16 * sizeof(uint32_t)));
    memcpy((uint32_t *)(&arp_table->arpt_pref[13]), &arp_init_table.arpt_pref[15], (12 * sizeof(uint32_t)));
#endif
#else
    memcpy((uint32_t *)arp_table, &arp_init_table, sizeof(arp_init_table));
#endif // __EXCLUDE_ROM_BLE_ARP__

#if defined(__IS_SDK6_COMPILER_GCC__) && !defined(__clang__)
#pragma GCC diagnostic pop
#endif

    arp_table->tx_tbase                   = (uint32_t)&(arp_table->tx_en_delay) - (uint32_t)base_addr;
    arp_table->rx_tbase                   = (uint32_t)&(arp_table->rx_en_delay) - (uint32_t)base_addr;
}

void rf_recalibration(void)
{
    rf_adplldig_activate();
    otp_cs_load_pd_adpll();              // Trim values for PD_ADPLL from OTP CS

    set_recommended_settings();          // Preferred settings
    update_radiopwrupdn_pref_setting();

#if (USE_RF_LDO_CALIBRATION)
    rf_ldo_calibration();
#else
    rf_calibration();                    // Calibration
#endif
    ble_update_arp_adpll_calib_vals();

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();
}

#if defined(CFG_PRODUCTION_TEST) && defined(CFG_ENABLE_KDCO_RECALIBRATION)
#include "ate_kdco_cal.h"

uint32_t rf_prod_test_kdco_otp_value;
bool rf_prod_test_kdco_recovered;
uint32_t rf_prod_test_kdco_get_current_value(void)
{
    return rf_prod_test_kdco_otp_value;
}

uint32_t rf_prod_test_kdco_recalibration(bool apply_value)
{
    uint32_t calibration_value;

    rf_adplldig_activate();
    otp_cs_load_pd_adpll();              // Trim values for PD_ADPLL from OTP CS

    set_recommended_settings();          // Preferred settings
    update_radiopwrupdn_pref_setting();
    
    calibration_value = ate_kdco_calibration(apply_value);

