sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rf/src/ble_arp.c
    ble_update_arp();

    if ((!rf_prod_test_kdco_recovered) || (apply_value)) {
        for (uint8_t i = 0; i < OTP_CS_PD_ADPLL_LEN; i++)
        {
            if (otp_cs.pd_adpll[i].addr == ADPLL_KDCO_CAL_CTRL1_REG)
            {
                if(!rf_prod_test_kdco_recovered) {
                    rf_prod_test_kdco_otp_value = otp_cs.pd_adpll[i].val;
                    rf_prod_test_kdco_recovered = true;
                }

                if(apply_value)
                {
                    otp_cs.pd_adpll[i].val = calibration_value;
                }
                break;
            }
        }
    }

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();

    return calibration_value;
}
#endif // defined(CFG_PRODUCTION_TEST) && defined(CFG_ENABLE_KDCO_RECALIBRATION)

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
/// BLE RF mode
typedef enum
{
    /// Advertising mode
    RF_PWR_MODE_ADV = 0,

    /// Connected mode
    RF_PWR_MODE_CONN = 1
} rf_pwr_mode_t;

/**
 ****************************************************************************************
 * @brief Helper function being called by @c ble_arp_update_tx_pwr.
 * @param[in] pwr_mode The BLE RF mode: advertising; connected.
 * @param[in] conidx The connection index.
 ****************************************************************************************
 */
static void update_pwr(rf_pwr_mode_t pwr_mode, uint8_t conidx)
{
    rf_tx_pwr_lvl_t tx_pwr;

    if (pwr_mode == RF_PWR_MODE_ADV)
    {
        // BLE RF advertising mode
        tx_pwr = rf_pa_pwr_adv_get();
    }
    else
    {
        // BLE RF connected mode
        tx_pwr = rf_pa_pwr_conn_get(conidx);
    }

    // Select between 0dBm and 3dBm settings
    if (tx_pwr > RF_TX_PWR_LVL_0d0)
    {
        // Use TRIM_DUTY_NEG and TRIM_DUTY_POS for 3dBm (residing in the lower
        // 16 bits of RF_PA_CTRL_REG)
        arp_table->arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf.data = (uint16_t) otp_cs_get_rf_pa_ctrl_3dBm();

        // Use TXDIV_TRIM for 3dBm (residing in the upper 16 bits of ADPLL_DIV_CTRL_REG)
        arp_table->arpt_pref[8].bf.data = (uint16_t) (otp_cs_get_adpll_div_ctrl_3dBm() >> 16);

        // Load user radio power settings depending on the detected mode
        arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = (tx_pwr << 8);
    }
    else
    {
        // Use TRIM_DUTY_NEG and TRIM_DUTY_POS for 0dBm (residing in the lower
        // 16 bits of RF_PA_CTRL_REG)
        arp_table->arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf.data = (uint16_t) otp_cs_get_rf_pa_ctrl_0dBm();

        // Use TXDIV_TRIM for 0dBm (residing in the upper 16 bits of ADPLL_DIV_CTRL_REG)
        arp_table->arpt_pref[8].bf.data = (uint16_t) (otp_cs_get_adpll_div_ctrl_0dBm() >> 16);

        if (rf_nfm_is_enabled())
        {
            // Near Field Mode Enable
            arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = RF_TX_PWR_LVL_MIN_DBM << 8;
        }
        else
        {
            // Load user radio power settings depending on the detected mode
            arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = (tx_pwr << 8);
        }
    }
}

/**
 ****************************************************************************************
 * @brief Updates the radio output power depending on the detected BLE event.
 ****************************************************************************************
 */
void ble_arp_update_tx_pwr(void)
{
    // Get the scheduled BLE event
    struct ea_elt_tag *elt  = (struct ea_elt_tag *) co_list_pick(&lld_evt_env.elt_prog);
    struct lld_evt_tag *evt = LLD_EVT_ENV_ADDR_GET(elt);

    if (evt->mode == LLD_EVT_ADV_MODE)
    {
        update_pwr(RF_PWR_MODE_ADV, 0);
    }
    else if ((evt->mode == LLD_EVT_MST_MODE) || (evt->mode == LLD_EVT_SLV_MODE))
    {
        update_pwr(RF_PWR_MODE_CONN, evt->conhdl);
    }
}
#endif // CFG_ENHANCED_TX_PWR_CTRL

#endif // __FPGA__
#endif // __DA14531__
